src/DataProcessors/инкВедомостьНачисленийУдержаний/инкВедомостьНачисленийУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>инкВедомостьНачисленийУдержаний</name>
</mdclass:DataProcessor>

src/ChartsOfCalculationTypes/инкУдержания/инкУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>инкУдержания</name>
  <baseCalculationTypes>ChartOfCalculationTypes.инкНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.инкУдержания</baseCalculationTypes>
  <predefined>
    <items>
      <name>Аванс</name>
      <description>Аванс</description>
    </items>
    <items>
      <name>Алименты</name>
      <description>Алименты</description>
    </items>
    <items>
      <name>ВыплатаОтпускныхИБЛВТекущемМесяце</name>
      <description>Выпл. отпуск. и б/л в текущем месяце</description>
    </items>
    <items>
      <name>Долг</name>
      <description>Долг</description>
    </items>
    <items>
      <name>ЗарплатаПредыдущегоМесяца</name>
      <description>Зарплата предыдущего месяца</description>
    </items>
    <items>
      <name>ЗарплатаТекущегоМесяца</name>
      <description>Зарплата текущего месяца</description>
    </items>
    <items>
      <name>ИсполнительныйЛист</name>
      <description>Исполнительный лист</description>
    </items>
    <items>
      <name>МежрасчетныеВыплаты</name>
      <description>Межрасчетные выплаты</description>
    </items>
    <items>
      <name>Подарки</name>
      <description>Подарки</description>
    </items>
    <items>
      <name>ПрофсоюзныйВзнос</name>
      <description>Профсоюзный взнос</description>
    </items>
    <items>
      <name>ПрочиеУдержания</name>
      <description>Прочие удержания</description>
    </items>
  </predefined>
  <attributes>
    <name>ВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кредит</name>
    <type>
      <types>ChartOfAccountsRef.инкХозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВСтаройПрограмме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

src/DataProcessors/инкВедомостьНачисленийУдержаний/ObjectModule.bsl
#Область о // Параметры:

// Параметры:
//	ДанныеДляОтчета - структура, содержит информацию для формирования отчета 
//					  см. инкОтчетыСервер.ПолучитьСтруктуруДляВедомостиНачисленийУдержаний().
//						
//
//	ТабличныеДокументы - структура, содержит табличные документы для вывода на печать:	
//  	ВедомостьНачислений 	- табличный документ, Ведомость начислений. 
//		ВедомостьУдержаний		- табличный документ, Ведомость удержаний.

#КонецОбласти

#Область о // Переменные:

Перем ДанныеДляОтчета Экспорт;

#КонецОбласти

#Область о // Инициализация:

Процедура Инициализация() Экспорт
	
	ДанныеДляОтчета = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область о // Исходные данные:

Функция ПолучитьИсходныеДанные(ДанныеДляОтчета)
	
	ИсходныеДанные = Новый Структура;
	ИсходныеДанные.Вставить("НачисленияСоответсвие",ПолучитьНачисленияСоответсвие(ДанныеДляОтчета));
	ИсходныеДанные.Вставить("УдержанияТаблица",ПолучитьУдержанияТаблица(ДанныеДляОтчета));
	ИсходныеДанные.Вставить("УдержанияСоответствие",ПолучитьУдержанияСоответсвие(ИсходныеДанные));
	
	Возврат ИсходныеДанные;
	
КонецФункции

Функция ПолучитьУдержанияСоответсвие(ИсходныеДанные)
	
	УдержанияСоответсвие = Новый Соответствие;
	ПрочиеУдержания = ИсходныеДанные.УдержанияТаблица;
	
	Для каждого УдержаниеСтрока Из ПрочиеУдержания Цикл
		УдержанияСоответсвие.Вставить(УдержаниеСтрока.Удержание,"Код - "+УдержаниеСтрока.Удержание.Код);			
	КонецЦикла; 
	
	Возврат УдержанияСоответсвие;
	
КонецФункции

Функция ПолучитьНачисленияСоответсвие(ДанныеДляОтчета)
	
	НачисленияСоответсвие = Новый Соответствие;
	ПрочиеНачисления = ДанныеДляОтчета.ТаблицаПрочихНачислений;
	
	Для каждого НачислениеСтрока Из ПрочиеНачисления Цикл
		Если ЗначениеЗаполнено(НачислениеСтрока.Начисление) Тогда
			НачисленияСоответсвие.Вставить(НачислениеСтрока.Начисление,"Код - "+НачислениеСтрока.Начисление.Код);			
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат НачисленияСоответсвие;
	
КонецФункции

Функция ПолучитьУдержанияТаблица(ДанныеДляОтчета)
	
	УдержанияСводТаблица = Новый ТаблицаЗначений;
	ПрочиеУдержания = ДанныеДляОтчета.ТаблицаПрочихУдержаний;
	УдержанияСводТаблица = ПрочиеУдержания.Скопировать();
	УдержанияСводТаблица.Очистить();
	
	Для каждого УдержаниеСтрока Из ПрочиеУдержания Цикл
		
		УдержанияСводСтрока = УдержанияСводТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(УдержанияСводСтрока,УдержаниеСтрока);
		
		ВидУдержания = УдержаниеСтрока.Удержание;
		Если СтрНайти(НРег(УдержаниеСтрока.Удержание.Наименование),НРег("Аванс")) > 0 Тогда
			ВидУдержания = ПланыВидовРасчета.инкУдержания.Аванс;
		ИначеЕсли СтрНайти(НРег(УдержаниеСтрока.Удержание.Наименование),НРег("Долг")) > 0 Тогда	
			ВидУдержания = ПланыВидовРасчета.инкУдержания.Долг;
		ИначеЕсли СтрНайти(НРег(УдержаниеСтрока.Удержание.Наименование),НРег("Подарки")) > 0 Тогда	
			ВидУдержания = ПланыВидовРасчета.инкУдержания.Подарки;
		ИначеЕсли СтрНайти(НРег(УдержаниеСтрока.Удержание.Наименование),НРег("Алименты")) > 0 Тогда	
			ВидУдержания = ПланыВидовРасчета.инкУдержания.Алименты;
		КонецЕсли;
		
		УдержанияСводСтрока.Удержание = ВидУдержания;
			
	КонецЦикла;                 
	
	УдержанияСводТаблица.Свернуть("Сотрудник,Удержание","СуммаУдержания");
	
	Возврат УдержанияСводТаблица;
	
КонецФункции

#КонецОбласти

#Область о // Сформировать отчет:

Функция ПолучитьТабличныеДокументы() Экспорт
	
	ТабличныеДокументы = Новый Структура;
	ТабличныеДокументы.Вставить("ВедомостьНачислений");
	ТабличныеДокументы.Вставить("ВедомостьУдержаний");

	ИсходныеДанные = ПолучитьИсходныеДанные(ДанныеДляОтчета);
	ТабличныеДокументы.ВедомостьНачислений = СформироватьВедомостьНачислений(ДанныеДляОтчета,ИсходныеДанные);
	ТабличныеДокументы.ВедомостьУдержаний = СформироватьВедомостьУдержаний(ДанныеДляОтчета,ИсходныеДанные);
	
	Возврат ТабличныеДокументы;
	
КонецФункции

Процедура ВывестиБлокРасшифровки(НачисленияУдержанияСоответсвие,ВедомостьМакет,ВедомостьТабличныйДокумент)
	
	Если НачисленияУдержанияСоответсвие.Количество() > 0 Тогда
		
		РасшифровкаЗаголовокОбласть = ВедомостьМакет.ПолучитьОбласть("РасшифровкаЗаголовок");
		ВедомостьТабличныйДокумент.Вывести(РасшифровкаЗаголовокОбласть);
		
		РасшифровкаСтрокаОбласть = ВедомостьМакет.ПолучитьОбласть("РасшифровкаСтрока");
		Для каждого НачисленияУдержанияЗначение Из НачисленияУдержанияСоответсвие Цикл
			РасшифровкаСтрокаОбласть.Параметры.Расшифровка = Строка(НачисленияУдержанияЗначение.Значение) + ": " 
														   + Строка(НачисленияУдержанияЗначение.Ключ) + ";";	
			ВедомостьТабличныйДокумент.Вывести(РасшифровкаСтрокаОбласть);	
		КонецЦикла; 
		
	КонецЕсли; 
	    	
КонецПроцедуры                                                   

#Область о // Таблица начислений:

Функция СформироватьВедомостьНачислений(ДанныеДляОтчета,ИсходныеДанные)
	
	ВедомостьНачислений = Новый ТабличныйДокумент;
	ВедомостьНачисленийМакет = ПолучитьМакет("МакетВедомостьНачисленийУдержаний");
	
	// Заголовок:
	ЗаголовокОбласть = ВедомостьНачисленийМакет.ПолучитьОбласть("ЗаголовокОтчета");
	ЗаголовокОбласть.Параметры.НачисленийУдержаний = "начислений";
	ЗаголовокОбласть.Параметры.ДатаВедомости = Формат(ДанныеДляОтчета.МесяцНачисления, "ДФ='ММММ гггг'") + "г.";
	ЗаголовокОбласть.Параметры.Организация = ДанныеДляОтчета.Организация;
	ЗаголовокОбласть.Параметры.Подразделение = ДанныеДляОтчета.Подразделение;
	ВедомостьНачислений.Вывести(ЗаголовокОбласть);
	
	ВывестиБлокТаблицыНачислений("ТаблицаЗаголовок",ВедомостьНачислений,ВедомостьНачисленийМакет,ИсходныеДанные);
	
	Для каждого ВедомостьСтрока Из ДанныеДляОтчета.ТаблицаВедомость Цикл
		ВывестиБлокТаблицыНачислений("ТаблицаСтрока",ВедомостьНачислений,ВедомостьНачисленийМакет,ИсходныеДанные,ВедомостьСтрока);
	КонецЦикла; 
	
	ВывестиБлокТаблицыНачислений("ТаблицаИтог",ВедомостьНачислений,ВедомостьНачисленийМакет,ИсходныеДанные,,ДанныеДляОтчета.ТаблицаВедомость);

	// Расшифровка:
	ВывестиБлокРасшифровки(ИсходныеДанные.НачисленияСоответсвие,ВедомостьНачисленийМакет,ВедомостьНачислений);
	
	ВедомостьНачислений.ФиксацияСлева = 1;
	
	Возврат ВедомостьНачислений;
	
КонецФункции

Процедура ВывестиБлокТаблицыНачислений(ИмяСтроки,ВедомостьТабличныйДокумент,ВедомостьМакет,ИсходныеДанные,ВедомостьСтрока = Неопределено,ВедомостьТаблица = Неопределено)
	
	// Таблица:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаФИО");
	Если ИмяСтроки = "ТаблицаСтрока" Тогда
		ТаблицаОбласть.Параметры.ФИО = ВедомостьСтрока.Сотрудник.ФИОСокращенное;
	КонецЕсли; 
	ВедомостьТабличныйДокумент.Вывести(ТаблицаОбласть);
	
	// Сальдо:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
	Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
		ТаблицаОбласть.Параметры.НачислениеУдержание = "Сальдо";	
	ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда 	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.СальдоВходящее;
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("СальдоВходящее");	
	КонецЕсли; 
	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);
	// Оклад:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
	Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
		ТаблицаОбласть.Параметры.НачислениеУдержание = "Оклад";
	ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда 	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.Оклад;	
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("Оклад");
	КонецЕсли; 	
	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);
	// РК:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
	Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
		ТаблицаОбласть.Параметры.НачислениеУдержание = "РК";
	ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда 	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.РайонныйКоэффициент;
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("РайонныйКоэффициент");	
	КонецЕсли; 	
	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);
	// СН:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
	Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
		ТаблицаОбласть.Параметры.НачислениеУдержание = "СН";
	ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда 	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.СевернаяНадбавка;
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("СевернаяНадбавка");
	КонецЕсли; 		
	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);

	// Прочие начисления:
	Для каждого НачисленияЗначение Из ИсходныеДанные.НачисленияСоответсвие Цикл
		ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
		Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
        	ТаблицаОбласть.Параметры.НачислениеУдержание = НачисленияЗначение.Значение;
		ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда 	
			ТаблицаОбласть.Параметры.Сумма = ПолучитьСуммуНачисления(ВедомостьСтрока.Сотрудник,НачисленияЗначение.Ключ,ДанныеДляОтчета.ТаблицаПрочихНачислений);
		ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
			ТаблицаОбласть.Параметры.Сумма = ПолучитьСуммуНачисления(Неопределено,НачисленияЗначение.Ключ,ДанныеДляОтчета.ТаблицаПрочихНачислений);
		КонецЕсли;	
		ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);
	КонецЦикла; 
	
	// Всего:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаВсего");
	Если ИмяСтроки = "ТаблицаСтрока" Тогда 	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.ВсегоНачислено;
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("ВсегоНачислено");
	КонецЕсли;	

	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);
	
КонецПроцедуры

Функция ПолучитьСуммуНачисления(Сотрудник,НачисленияЗначение,ПрочиеНачисления)
	
	СуммаНачисления = 0;
	
	ПоискЗначения = Новый Структура;
	Если Сотрудник <> Неопределено Тогда
		ПоискЗначения.Вставить("Сотрудник",Сотрудник);	             
	КонецЕсли; 
	ПоискЗначения.Вставить("Начисление",НачисленияЗначение);
	
	НачисленияМассив = ПрочиеНачисления.НайтиСтроки(ПоискЗначения);
	
	Для каждого НачисленияЭлемент Из НачисленияМассив Цикл
		СуммаНачисления = СуммаНачисления + НачисленияЭлемент.СуммаНачисления;
	КонецЦикла; 
	
	Возврат СуммаНачисления;
	
КонецФункции

#КонецОбласти

#Область о // Таблица удержаний:

Функция СформироватьВедомостьУдержаний(ДанныеДляОтчета,ИсходныеДанные)
	
	ВедомостьУдержаний = Новый ТабличныйДокумент;
	ВедомостьУдержанийМакет = ПолучитьМакет("МакетВедомостьНачисленийУдержаний");
	
	// Заголовок:
	ЗаголовокОбласть = ВедомостьУдержанийМакет.ПолучитьОбласть("ЗаголовокОтчета");
	ЗаголовокОбласть.Параметры.НачисленийУдержаний = "удержаний";
	ЗаголовокОбласть.Параметры.ДатаВедомости = Формат(ДанныеДляОтчета.МесяцНачисления, "ДФ='ММММ гггг'") + "г.";
	ЗаголовокОбласть.Параметры.Подразделение = ДанныеДляОтчета.Подразделение;
	ЗаголовокОбласть.Параметры.Организация = ДанныеДляОтчета.Организация;
	ВедомостьУдержаний.Вывести(ЗаголовокОбласть);
	
	// Таблица:
	ВывестиБлокТаблицыУдержаний("ТаблицаЗаголовок",ВедомостьУдержаний,ВедомостьУдержанийМакет,ИсходныеДанные);
	
	Для каждого ВедомостьСтрока Из ДанныеДляОтчета.ТаблицаВедомость Цикл
		ВывестиБлокТаблицыУдержаний("ТаблицаСтрока",ВедомостьУдержаний,ВедомостьУдержанийМакет,ИсходныеДанные,ВедомостьСтрока);
	КонецЦикла; 
	
	ВывестиБлокТаблицыУдержаний("ТаблицаИтог",ВедомостьУдержаний,ВедомостьУдержанийМакет,ИсходныеДанные);

	// Расшифровка:
	ВывестиБлокРасшифровки(ИсходныеДанные.УдержанияСоответствие,ВедомостьУдержанийМакет,ВедомостьУдержаний);
	
	ВедомостьУдержаний.ФиксацияСлева = 1;
	
	Возврат ВедомостьУдержаний;
	
КонецФункции                                                            

Процедура ВывестиБлокТаблицыУдержаний(ИмяСтроки,ВедомостьТабличныйДокумент,ВедомостьМакет,ИсходныеДанные,ВедомостьСтрока = Неопределено,ВедомостьТаблица = Неопределено)
	
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаФИО");
	Если ИмяСтроки = "ТаблицаСтрока" Тогда
		ТаблицаОбласть.Параметры.ФИО = ВедомостьСтрока.Сотрудник.ФИОСокращенное;	
	КонецЕсли; 
	ВедомостьТабличныйДокумент.Вывести(ТаблицаОбласть);
	
	// Вх. сальдо:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
	Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
		ТаблицаОбласть.Параметры.НачислениеУдержание = "Вх. сальдо";
	ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.СальдоВходящее;	
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("СальдоВходящее");
	КонецЕсли;	
	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);
	
	// Налог:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
	Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
		ТаблицаОбласть.Параметры.НачислениеУдержание = "Налог";
	ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.НДФЛ;
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("НДФЛ");	
	КонецЕсли;	
	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);
	
	// Профс.:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
	Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
		ТаблицаОбласть.Параметры.НачислениеУдержание = "Профс.";
	ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.Профсоюз;	
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("Профсоюз");	
	КонецЕсли;	
	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);
	
	// Исп. лист:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
	Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
		ТаблицаОбласть.Параметры.НачислениеУдержание = "Исп. лист";
	ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда  	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.Алименты;	
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("Алименты");	
	КонецЕсли;	
	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);

	// ПрочиеУдержания:
	Для каждого УдержаниеЭлемент Из ИсходныеДанные.УдержанияСоответствие Цикл
		
		ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
		Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
			ТаблицаОбласть.Параметры.НачислениеУдержание = УдержаниеЭлемент.Значение;
		ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда	
			
			СуммаУдержания = 0;
			ПоискСотрудника = Новый Структура;
			ПоискСотрудника.Вставить("Сотрудник",ВедомостьСтрока.Сотрудник);
			ПоискСотрудника.Вставить("Удержание",УдержаниеЭлемент.Ключ);
			
			УдержанияСводМассив = ИсходныеДанные.УдержанияТаблица.НайтиСтроки(ПоискСотрудника);
			Для каждого УдержанияСводЭлемент Из УдержанияСводМассив Цикл
				СуммаУдержания = СуммаУдержания + УдержанияСводЭлемент.СуммаУдержания;	
			КонецЦикла;
			
			ТаблицаОбласть.Параметры.Сумма = СуммаУдержания;
			
		ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	

			СуммаУдержания = 0;
			ПоискСотрудника = Новый Структура;
			ПоискСотрудника.Вставить("Удержание",УдержаниеЭлемент.Ключ);
			
			УдержанияСводМассив = ИсходныеДанные.УдержанияТаблица.НайтиСтроки(ПоискСотрудника);
			Для каждого УдержанияСводЭлемент Из УдержанияСводМассив Цикл
				СуммаУдержания = СуммаУдержания + УдержанияСводЭлемент.СуммаУдержания;	
			КонецЦикла;
			
			ТаблицаОбласть.Параметры.Сумма = СуммаУдержания;
			
		КонецЕсли;
		
		ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);
		
	КонецЦикла; 
	
	// Всего:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаВсего");
	Если ИмяСтроки = "ТаблицаСтрока" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.ВсегоУдержано;
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("ВсегоУдержано");	
	КонецЕсли;
	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);
	
	// Сальдо:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
	Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
		ТаблицаОбласть.Параметры.НачислениеУдержание = "Сальдо";
	ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.СальдоИсходящее;	
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("СальдоИсходящее");
	КонецЕсли;	
	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);

	// На руки:
	ТаблицаОбласть = ВедомостьМакет.ПолучитьОбласть(ИмяСтроки+"|ТаблицаНачислениеУдержание");
	Если ИмяСтроки = "ТаблицаЗаголовок" Тогда
		ТаблицаОбласть.Параметры.НачислениеУдержание = "На руки";
	ИначеЕсли ИмяСтроки = "ТаблицаСтрока" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ВедомостьСтрока.ВсегоНачислено 
		                               - ВедомостьСтрока.ВсегоУдержано;	         
	ИначеЕсли ИмяСтроки = "ТаблицаИтог" Тогда	
		ТаблицаОбласть.Параметры.Сумма = ДанныеДляОтчета.ТаблицаВедомость.Итог("ВсегоНачислено")
		                               - ДанныеДляОтчета.ТаблицаВедомость.Итог("ВсегоУдержано");
	КонецЕсли;	
	ВедомостьТабличныйДокумент.Присоединить(ТаблицаОбласть);
	
	
КонецПроцедуры                                                                   

Функция ПолучитьСводнуюТаблицуПоУдержаниям(Сотрудник,ТаблицаПрочихУдержаний)

	ПрочиеУдержанияСвод = Новый ТаблицаЗначений;
	ПрочиеУдержанияСвод.Колонки.Вставить("НачислениеУдержание");
	ПрочиеУдержанияСвод.Колонки.Вставить("Сумма");

    // Выделение прочих начислений, для вывода в таблицу:
	ПоискЗначения = Новый Структура;
	ПоискЗначения.Вставить("Сотрудник",Сотрудник);	             
	
	ПрочиеУдержанияМассив = ТаблицаПрочихУдержаний.НайтиСтроки(ПоискЗначения);

	Для каждого ПрочиеУдержанияСтрока Из ПрочиеУдержанияМассив Цикл
		
		ПрочиеУдержанияСводСтрока = ПрочиеУдержанияСвод.Добавить();
		
		ПрочиеУдержанияСводСтрока.НачислениеУдержание = ПланыВидовРасчета.инкУдержания.ПрочиеУдержания;
		Если СтрНайти(НРег(ПрочиеУдержанияСтрока.Удержание.Наименование),НРег("аванс")) > 0 Тогда
			ПрочиеУдержанияСводСтрока.НачислениеУдержание = ПланыВидовРасчета.инкУдержания.Аванс;
		ИначеЕсли СтрНайти(НРег(ПрочиеУдержанияСтрока.Удержание.Наименование),НРег("долг")) > 0 Тогда
			ПрочиеУдержанияСводСтрока.НачислениеУдержание = ПланыВидовРасчета.инкУдержания.Долг;	
		ИначеЕсли СтрНайти(НРег(ПрочиеУдержанияСтрока.Удержание.Наименование),НРег("подарки")) > 0 Тогда
			ПрочиеУдержанияСводСтрока.НачислениеУдержание = ПланыВидовРасчета.инкУдержания.Подарки;	
		ИначеЕсли СтрНайти(НРег(ПрочиеУдержанияСтрока.Удержание.Наименование),НРег("алименты")) > 0 Тогда
			ПрочиеУдержанияСводСтрока.НачислениеУдержание = ПланыВидовРасчета.инкУдержания.Алименты;
		КонецЕсли;               
		
		ПрочиеУдержанияСводСтрока.Сумма = ПрочиеУдержанияСтрока.Сумма;
		
	КонецЦикла;
	ПрочиеУдержанияСвод.Свернуть("НачислениеУдержание","Сумма");
	
	Возврат ПрочиеУдержанияСвод;	
	
КонецФункции                    

Функция ПолучитьСуммуУдержения(Сотрудник,УдержанияЗначение,ПрочиеУдержания)
	
	СуммаУдержания = 0;
	
	ПоискЗначения = Новый Структура;
	Если Сотрудник <> Неопределено Тогда
		ПоискЗначения.Вставить("Сотрудник",Сотрудник);	             
	КонецЕсли; 
	ПоискЗначения.Вставить("Удержание",УдержанияЗначение);
	
	УдержанияМассив = ПрочиеУдержания.НайтиСтроки(ПоискЗначения);
	
	Для каждого УдержанияЭлемент Из УдержанияМассив Цикл
		СуммаУдержания = СуммаУдержания + УдержанияЭлемент.СуммаУдержания;
	КонецЦикла; 
	
	Возврат СуммаУдержания;
	
КонецФункции

#КонецОбласти

#КонецОбласти
